In [5]:
dict1 = {
    'name': 'test',
    'geo' : {
        'latitude': 20.52576,
        'longitude': 5.22058
    }
}

dict1['geo']['longitude']

5.22058

In [1]:
import pandas as pd

In [2]:
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
'age': [20, 19, 22, 21],
'favorite_color': ['blue', 'blue', 'yellow', "green"],
'grade': [88, 92, 95, 70]}

df = pd.DataFrame(raw_data)
df.head()

               name  age favorite_color  grade
0    Willard Morris   20           blue     88
1       Al Jennings   19           blue     92
2      Omar Mullins   22         yellow     95
3  Spencer McDaniel   21          green     70

In [21]:
#To select rows whose column value equals a scalar, some_value, use ==:
for i in df.loc[df['favorite_color'] == 'yellow','grade']:
    print(i)

95

In [10]:
# import pandas as pd
# df = pd.DataFrame({'time': [pd.to_datetime('2019-01-15 13:25:43')]})
# df_unix_sec = pd.to_datetime(df['time']).astype(int)/ 10**9
# print(df_unix_sec)

import pandas as pd
df = pd.DataFrame({'time': [pd.to_datetime('13:25:43')]})

pd.to_timedelta(df.time).dt.total_seconds()
# or
# (df.time - pd.to_datetime('1970-01-01')).dt.total_seconds()

0    1.572183e+09
Name: time, dtype: float64

In [3]:
3 not in range(1,6)

False

In [7]:
[i for i not in [88, 92, 95, 70] ]

SyntaxError: invalid syntax (<ipython-input-7-84f2535c2d6d>, line 1)

In [9]:
num =15.1282525
round(num,2)

15.13

In [1]:
import pandas as pd
df = pd.DataFrame({'time': [pd.to_datetime('13:25:43')]})

In [2]:
df

                 time
0 2019-10-28 13:25:43